Revit 2024 API
ParameterTypeId.RebarHookRotationAtEnd Property
 "Hook Rotation At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarHookRotationAtEnd { get; }
Visual Basic
Public Shared ReadOnly Property RebarHookRotationAtEnd As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarHookRotationAtEnd {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace